tests/UKHO.ERPFacade.API.UnitTests/ERPTestData/UnsortedActionItems.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Z_ADDS_MAT_INFO xmlns="urn:sap-com:document:sap:rfc:functions">
      <IM_MATINFO xmlns="">
        <CORRID></CORRID>
        <NOOFACTIONS></NOOFACTIONS>
        <RECDATE></RECDATE>
        <RECTIME></RECTIME>
        <ORG>UKHO</ORG>
        <ACTIONITEMS>
          <Item>
            <ACTIONNUMBER>2</ACTIONNUMBER>
            <ACTION>CREATE AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL></CHILDCELL>
            <PRODUCTNAME>US5AK9DI</PRODUCTNAME>
            <CANCELLED></CANCELLED>
            <REPLACEDBY></REPLACEDBY>
            <AGENCY>US</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>medium</ENCSIZE>
            <TITLE>Amlia Island - Svechnikof Harbor</TITLE>
            <EDITIONNO></EDITIONNO>
            <UPDATENO></UPDATENO>
            <UNITTYPE>AVCS Units Harbour</UNITTYPE>
            <WEEKNO>202431</WEEKNO>
            <VALIDFROM>20240801</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY></ACTIVEKEY>
            <NEXTKEY></NEXTKEY>
          </Item>
          <Item>
            <ACTIONNUMBER>3</ACTIONNUMBER>
            <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>US5AK9DI</CHILDCELL>
            <PRODUCTNAME>US5AK9DI</PRODUCTNAME>
            <CANCELLED></CANCELLED>
            <REPLACEDBY></REPLACEDBY>
            <AGENCY></AGENCY>
            <PROVIDER></PROVIDER>
            <ENCSIZE></ENCSIZE>
            <TITLE></TITLE>
            <EDITIONNO></EDITIONNO>
            <UPDATENO></UPDATENO>
            <UNITTYPE></UNITTYPE>
            <WEEKNO>202431</WEEKNO>
            <VALIDFROM>20240801</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY></ACTIVEKEY>
            <NEXTKEY></NEXTKEY>
          </Item>
          <Item>
            <ACTIONNUMBER>1</ACTIONNUMBER>
            <ACTION>CREATE ENC CELL</ACTION>
            <PRODUCT>ENC CELL</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>US5AK9DI</CHILDCELL>
            <PRODUCTNAME>US5AK9DI</PRODUCTNAME>
            <CANCELLED></CANCELLED>
            <REPLACEDBY></REPLACEDBY>
            <AGENCY>US</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>medium</ENCSIZE>
            <TITLE>Amlia Island - Svechnikof Harbor</TITLE>
            <EDITIONNO>1</EDITIONNO>
            <UPDATENO>0</UPDATENO>
            <UNITTYPE></UNITTYPE>
            <WEEKNO>202431</WEEKNO>
            <VALIDFROM>20240801</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY>firstkey</ACTIVEKEY>
            <NEXTKEY>nextkey</NEXTKEY>
          </Item>
          <Item>
            <ACTIONNUMBER>3</ACTIONNUMBER>
            <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>US5AK9DI</CHILDCELL>
            <PRODUCTNAME>PAYSF</PRODUCTNAME>
            <CANCELLED></CANCELLED>
            <REPLACEDBY></REPLACEDBY>
            <AGENCY></AGENCY>
            <PROVIDER></PROVIDER>
            <ENCSIZE></ENCSIZE>
            <TITLE></TITLE>
            <EDITIONNO></EDITIONNO>
            <UPDATENO></UPDATENO>
            <UNITTYPE></UNITTYPE>
            <WEEKNO>202431</WEEKNO>
            <VALIDFROM>20240801</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY></ACTIVEKEY>
            <NEXTKEY></NEXTKEY>
          </Item>
        </ACTIONITEMS>
      </IM_MATINFO>
    </Z_ADDS_MAT_INFO>
  </soap:Body>
</soap:Envelope>
